RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/MK80F25615.svd
                  <description>Select 3 delay chain tap</description>
                  <value>#0000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011</name>
                  <description>Select 4 delay chain tap</description>
                  <value>#0000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100</name>
                  <description>Select 5 delay chain tap</description>
                  <value>#00000100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101</name>
                  <description>Select 6 delay chain tap</description>
                  <value>#00000101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110</name>
                  <description>Select 7 delay chain tap</description>
                  <value>#00000110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111</name>
                  <description>Select 8 delay chain tap</description>
                  <value>#00000111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001000</name>
                  <description>Select 9 delay chain tap</description>
                  <value>#000001000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001001</name>
                  <description>Select 10 delay chain tap</description>
                  <value>#000001001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001010</name>
                  <description>Select 11 delay chain tap</description>
                  <value>#000001010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001011</name>
                  <description>Select 12 delay chain tap</description>
                  <value>#000001011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001100</name>
                  <description>Select 13 delay chain tap</description>
                  <value>#000001100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001101</name>
                  <description>Select 14 delay chain tap</description>
                  <value>#000001101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001110</name>
                  <description>Select 15 delay chain tap</description>
                  <value>#000001110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001111</name>
                  <description>Select 16 delay chain tap</description>
                  <value>#000001111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010000</name>
                  <description>Select 17 delay chain tap</description>
                  <value>#0000010000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010001</name>
                  <description>Select 18 delay chain tap</description>
                  <value>#0000010001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010010</name>
                  <description>Select 19 delay chain tap</description>
                  <value>#0000010010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010011</name>
                  <description>Select 20 delay chain tap</description>
                  <value>#0000010011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010100</name>
                  <description>Select 21 delay chain tap</description>
                  <value>#0000010100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010101</name>
                  <description>Select 22 delay chain tap</description>
                  <value>#0000010101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010110</name>
                  <description>Select 23 delay chain tap</description>
                  <value>#0000010110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000010111</name>
                  <description>Select 24 delay chain tap</description>
                  <value>#0000010111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011000</name>
                  <description>Select 25 delay chain tap</description>
                  <value>#0000011000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011001</name>
                  <description>Select 26 delay chain tap</description>
                  <value>#0000011001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011010</name>
                  <description>Select 27 delay chain tap</description>
                  <value>#0000011010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011011</name>
                  <description>Select 28 delay chain tap</description>
                  <value>#0000011011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011100</name>
                  <description>Select 29 delay chain tap</description>
                  <value>#0000011100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011101</name>
                  <description>Select 30 delay chain tap</description>
                  <value>#0000011101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011110</name>
                  <description>Select 31 delay chain tap</description>
                  <value>#0000011110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0000011111</name>
                  <description>Select 32 delay chain tap</description>
                  <value>#0000011111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100000</name>
                  <description>Select 33 delay chain tap</description>
                  <value>#00000100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100001</name>
                  <description>Select 34 delay chain tap</description>
                  <value>#00000100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100010</name>
                  <description>Select 35 delay chain tap</description>
                  <value>#00000100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100011</name>
                  <description>Select 36 delay chain tap</description>
                  <value>#00000100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100100</name>
                  <description>Select 37 delay chain tap</description>
                  <value>#00000100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100101</name>
                  <description>Select 38 delay chain tap</description>
                  <value>#00000100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100110</name>
                  <description>Select 39 delay chain tap</description>
                  <value>#00000100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000100111</name>
                  <description>Select 40 delay chain tap</description>
                  <value>#00000100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101000</name>
                  <description>Select 41 delay chain tap</description>
                  <value>#00000101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101001</name>
                  <description>Select 42 delay chain tap</description>
                  <value>#00000101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101010</name>
                  <description>Select 43 delay chain tap</description>
                  <value>#00000101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101011</name>
                  <description>Select 44 delay chain tap</description>
                  <value>#00000101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101100</name>
                  <description>Select 45 delay chain tap</description>
                  <value>#00000101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101101</name>
                  <description>Select 46 delay chain tap</description>
                  <value>#00000101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101110</name>
                  <description>Select 47 delay chain tap</description>
                  <value>#00000101110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000101111</name>
                  <description>Select 48 delay chain tap</description>
                  <value>#00000101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110000</name>
                  <description>Select 49 delay chain tap</description>
                  <value>#00000110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110001</name>
                  <description>Select 50 delay chain tap</description>
                  <value>#00000110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110010</name>
                  <description>Select 51 delay chain tap</description>
                  <value>#00000110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110011</name>
                  <description>Select 52 delay chain tap</description>
                  <value>#00000110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110100</name>
                  <description>Select 53 delay chain tap</description>
                  <value>#00000110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110101</name>
                  <description>Select 54 delay chain tap</description>
                  <value>#00000110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110110</name>
                  <description>Select 55 delay chain tap</description>
                  <value>#00000110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000110111</name>
                  <description>Select 56 delay chain tap</description>
                  <value>#00000110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111000</name>
                  <description>Select 57 delay chain tap</description>
                  <value>#00000111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111001</name>
                  <description>Select 58 delay chain tap</description>
                  <value>#00000111001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111010</name>
                  <description>Select 59 delay chain tap</description>
                  <value>#00000111010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111011</name>
                  <description>Select 60 delay chain tap</description>
                  <value>#00000111011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111100</name>
                  <description>Select 61 delay chain tap</description>
                  <value>#00000111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111101</name>
                  <description>Select 62 delay chain tap</description>
                  <value>#00000111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111110</name>
                  <description>Select 63 delay chain tap</description>
                  <value>#00000111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00000111111</name>
                  <description>Select 64 delay chain tap</description>
                  <value>#00000111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF0IND</name>
          <description>Buffer0 Top Index Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPINDX0</name>
              <description>Top index of buffer 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF1IND</name>
          <description>Buffer1 Top Index Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPINDX1</name>
              <description>Top index of buffer 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF2IND</name>
          <description>Buffer2 Top Index Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPINDX2</name>
              <description>Top index of buffer 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFAR</name>
          <description>Serial Flash Address Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SFADR</name>
              <description>Serial Flash Address. The register content is used as byte address for all following IP Commands.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFACR</name>
          <description>Serial Flash Address Configuration Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAS</name>
              <description>Column Address Space</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WA</name>
              <description>Word Addressable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Byte addressable serial flash mode.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Word (2 byte) addressable serial flash mode.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR</name>
          <description>Sampling Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSENA</name>
              <description>Half Speed serial flash clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable divide by 2 of serial flash clock for half speed commands</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable divide by 2 of serial flash clock for half speed commands</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSPHS</name>
              <description>Half Speed Phase selection for SDR instructions.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Select sampling at non-inverted clock</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Select sampling at inverted clock</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSDLY</name>
              <description>Half Speed Delay selection for SDR instructions.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>One clock cycle delay</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Two clock cycle delay</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSPHS</name>
              <description>Full Speed Phase selection for SDR instructions.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Select sampling at non-inverted clock</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Select sampling at inverted clock. This bit is also used in DQS mode and ignored when using non-DQS DDR instructions.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSDLY</name>
              <description>Full Speed Delay selection for SDR instructions. Select the delay with respect to the reference edge for the sample point valid for full speed commands:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>One clock cycle delay</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Two clock cycles delay. This bit is also used in DQS mode and ignored when using non-DQS DDR instructions.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDRSMP</name>
              <description>DDR Sampling point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBSR</name>
          <description>RX Buffer Status Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDBFL</name>
              <description>RX Buffer Fill Level, indicates how many entries of 4 bytes are still available in the RX Buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDCTR</name>
              <description>Read Counter, indicates how many entries of 4 bytes have been removed from the RX Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
